{"pageProps":{"post":{"slug":"2021-03-13-my-workplace","title":"My workplace setup","subtitle":"How I try to keep backpain and RSI at bay","image":{"url":"/assets/content/blog/2021-03-13-my-workplace/office.jpg","alt":"My workplace - three monitors, desk, chair, keyboard, mouse, trackball","external":"https://foosel.net/assets/content/blog/2021-03-13-my-workplace/office.jpg"},"content":"\nI've been working full time from my home office since mid-2014 now. At the time of writing this post this is nearing 7 years. Naturally, considering how much time I spend there, I've also spent a lot of thought and money on making sure my workplace helps to keep the usual side effects of the mostly sedentary lifestyle of a developer at bay.\n\nOver the years I've had some run ins with RSI and backpain. My first wrist issues developed more than 10 years ago. Pain in my lower back beyond \"all fine again after a good night's sleep\" started in February of 2014. Both have been repeating visitors since then. You can probably imagine that that has led to a lot of research and experimentation to see what works and what doesn't for me. So, here's a summary of my findings as of March 2021. Quick disclaimer though, this is what has proven to work for **me**, that doesn't mean it will work for you, if in doubt please consult a professional. Also, I do link to some products here -- consider those references to give you more details on my setup, not official endorsement or anything like that.\n\n## Keyboard and mouse\n\nFor my wrists, **ergonomic keyboards** have proven to be crucial in combating the dreaded pain and numbness. I started with a [Microsoft Natural Ergonomic Keyboard 4000](https://www.microsoft.com/en-us/p/natural-ergonomic-keyboard-4000/) (what a name...), switched over to an [Microsoft Ergo Sculpt](https://www.microsoft.com/en-us/p/microsoft-sculpt-ergonomic-desktop/), had a quick detour over a regularly shaped [Ducky One TKL](https://www.duckychannel.com.tw/en/Ducky-One-RGB-TKL) to get my feet wet in mechanical keyboards and these days have arrived at the 1st gen [Ultimate Hacking Keyboard](https://ultimatehackingkeyboard.com/). It's a mechanical split keybord, sized at 60% (which means it has less keys than your common 101-key keyboard, only 60% of them to be precise, and compensates for that with the use of layers reached through modified keys) and fully programmable. I'm still optimizing the macros I have configured on it. I got it with red switches (linear and non clicky, I can't stand keyboards I can't use while holding a conversation ;)) and put a Git-themed keyset on it which I absolutely adore. And it's finally made me switch to US ANSI layout, which indeed is way better suited for coding than ISO DE. The UHK also supports some additional modules, and I have a trackpoint and an additional thumb keycluster on order once they finally release.\n\n![Closeup of my Ultimate Hacking Keyboard](./keyboard.jpg)\n\nNo matter how good you can memorize keyboard shortcuts (or how well the mouse layer of the UHK works), you still also need a **mouse**. In my case that's been gaming mice exclusively for 15+ years now, with a ton of turnover due to wear out or quality issues. Currently I'm sporting a [Steelseries Rival 310](https://steelseries.com/gaming-mice/rival-310) after my last mouse, a Roccat Kone XTD, developed a flaky mouse wheel I couldn't fix, even though I tried my best. Apparently a design flaw. The Steelseries has so far worked nicely, but I've only had it for less than six months at the time of writing this. It's an asymmetric mouse tailored for use with the right hand. I can reach the side buttons easily and it isn't too heavy or too light either.\n\nI also have a **trackball** though, dedicated to be used with my _left_ hand. Whenever I notice my right wrist acting up, I switch to exclusive trackball use for a while, and that has managed to still avert Bad Things a number of times now. If you find yourself regularly suffering from RSI issues on your mouse hand, I can really recommend to mix things up with a trackball on your left. Personally I got a [Kensington Slimblade](https://www.kensington.com/p/products/electronic-control-solutions/trackball-products/slimblade-trackball/). It's symmetrical and the buttons are easily remapped to fit a left hand operation. And the huge ball can also be used as a scrollwheel and is actually also a great fidget toy to have on the desk at all times ;)\n\n## Desk and chair\n\nIn my opinion, there are two pieces of furniture you should never cheap out on: your **office chair** and your bed. I bought my [sedus netwin](https://www.sedus.com/en/products/chairs/netwin) office chair right after finishing university in 2007 and apart from having gotten a bit more dirty here and there it's as good as new. I initially got it with a set of arm rests, but quickly figured out that those were actually detrimental to my posture and made me pull my shoulders up, leading to tension related pain. So I removed them. I've also gotten it a bit more pronounced lumbar support through the aid of [an add-on](https://www.amazon.de/gp/product/B07PB7G3QJ/), the likes of which you can order online for less than 10€ a piece. If I were to buy a new chair today, I'd probably get one with a head rest to keep me a bit more from slouching during long debugging or gaming sessions, but all in all I'm still completely happy with it, and the mesh back has proven to make sitting on it on hot summer days more bearable.\n\n![My office chair, with a lumbar support addon](./chair.jpg)\n\nI've now had an **electric standing desk** since January 2016. I'm currently trying to get into the habit of daily use of the standing mode again and so far it's looking good. I got the [IKEA Bekant](https://www.ikea.com/de/de/p/bekant-schreibtisch-sitz-steh-weiss-s69022537/) desk, and have since modified it to use the alternative [Megadesk](https://github.com/gcormier/megadesk) controller to give it position memory slots (and hopefully also to hook it up into my home automation system long term). I can't stress enough what a difference it can make to just stand for a while during your work day. Exclusively standing should definitely also be avoided (I've had to do this recently for a couple of days because my back would _not_ take sitting for an answer anymore, and it did a bit of a number on my ankles and knees), but regularly switching between sitting and standing is a great way not only to keep your posture intact but also to just get back your concentration. I currently work sitting until my lunch break, then switch to a couple hours of standing before either returning to sitting or calling it a day.\n\nSpeaking of sitting and standing -- I also recently acquired a bunch of accessories to make that more dynamic. While standing, I now regularly plant my feet on a **balance board** (a [Gymba](https://www.my-gymba.de/en) one in my case). It allows me to move while standing, to vary my stance more easily and frankly, it's also a ton of fun to seesaw back and forth while working. I use it with shoes - you can also use it barefoot/in socks, but frankly that was a bit to tough a surface or my feet. Your mileage may vary of course.\n\nI also got myself a **wobble stool** from [Flexispot](https://www.flexispot.com/height-adjustable-wobble-stool-bh1b). Imagine a stool, but instead of being stable it has a rounded base that makes it constantly wobble around. You cannot easily slouch on that, you'll fall over. Mine can be height adjusted from 61 to 82cm, so I use it both while standing as a small break, but also while sitting. I'm still getting used to it and am experimenting with heights and best way to sit on it, but it's so far been a great addition and doesn't take up much space (a serious plus in my limited office space).\n\n## Monitor mounts\n\nLast but not least, I've got my two main monitors mounted on a **dual monitor mount**, in my case a [gas lift one from PureMounts](http://www.puremounts.de/pm-office-dm-23d.html) (the small third monitor is mounted to the second one with a self designed printed mounting solution). The stands usually included with monitors tend to not offer enough flexibility to truly dial in the position of the screen in my experience, and this also managed to free up a _ton_ of desktop real estate that I can now utilize. In my case, a wallmount is not an option due to the standing desk situation, so I instead went for a desk mount. A gas lift is not the most stable option in my experience: things can be a bit shaky when I accidentally bump against the desk due to the rather extreme lever position I had to chose to make things work in my office, but it has been working just fine now since 2012. Still, at some point I might get something a bit more static. In any case, a monitor mount is something I'd highly recommended for everyone really, even if you don't want if for ergonomic reasons -- I cannot emphasize the increase in desk space enough ;)\n\n![My monitors, mounted on a gas lift mount](./monitors.jpg)\n\n## tl;dr\n\nGet a split ergo keyboard, a gaming mouse for your primary and a trackball for your off hand. Don't cheap out on your office chair, seriously consider investment in a standing desk, get a balance board with it and finally reclaim your desk and improve your workplace's ergonomy at the same time with a monitor mount.\n","assets":[{"slug":"2021-03-13-my-workplace","asset":"chair.jpg","path":"/home/runner/work/foosel.github.io/foosel.github.io/content/posts/2021-03-13-my-workplace/chair.jpg"},{"slug":"2021-03-13-my-workplace","asset":"keyboard.jpg","path":"/home/runner/work/foosel.github.io/foosel.github.io/content/posts/2021-03-13-my-workplace/keyboard.jpg"},{"slug":"2021-03-13-my-workplace","asset":"monitors.jpg","path":"/home/runner/work/foosel.github.io/foosel.github.io/content/posts/2021-03-13-my-workplace/monitors.jpg"},{"slug":"2021-03-13-my-workplace","asset":"office.jpg","path":"/home/runner/work/foosel.github.io/foosel.github.io/content/posts/2021-03-13-my-workplace/office.jpg"}],"published":"2021-03-13T00:00:00Z","readingtime":{"text":"8 min read","minutes":7.515,"time":450900,"words":1503},"mdx":{"compiledSource":"\"use strict\";\n\nvar _excluded = [\"components\"];\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\n/* @jsxRuntime classic */\n\n/* @jsx mdx */\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\n\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n      props = _objectWithoutProperties(_ref, _excluded);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"I've been working full time from my home office since mid-2014 now. At the time of writing this post this is nearing 7 years. Naturally, considering how much time I spend there, I've also spent a lot of thought and money on making sure my workplace helps to keep the usual side effects of the mostly sedentary lifestyle of a developer at bay.\"), mdx(\"p\", null, \"Over the years I've had some run ins with RSI and backpain. My first wrist issues developed more than 10 years ago. Pain in my lower back beyond \\\"all fine again after a good night's sleep\\\" started in February of 2014. Both have been repeating visitors since then. You can probably imagine that that has led to a lot of research and experimentation to see what works and what doesn't for me. So, here's a summary of my findings as of March 2021. Quick disclaimer though, this is what has proven to work for \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"me\"), \", that doesn't mean it will work for you, if in doubt please consult a professional. Also, I do link to some products here -- consider those references to give you more details on my setup, not official endorsement or anything like that.\"), mdx(\"h2\", null, \"Keyboard and mouse\"), mdx(\"p\", null, \"For my wrists, \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"ergonomic keyboards\"), \" have proven to be crucial in combating the dreaded pain and numbness. I started with a \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.microsoft.com/en-us/p/natural-ergonomic-keyboard-4000/\"\n  }, \"Microsoft Natural Ergonomic Keyboard 4000\"), \" (what a name...), switched over to an \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.microsoft.com/en-us/p/microsoft-sculpt-ergonomic-desktop/\"\n  }, \"Microsoft Ergo Sculpt\"), \", had a quick detour over a regularly shaped \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.duckychannel.com.tw/en/Ducky-One-RGB-TKL\"\n  }, \"Ducky One TKL\"), \" to get my feet wet in mechanical keyboards and these days have arrived at the 1st gen \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://ultimatehackingkeyboard.com/\"\n  }, \"Ultimate Hacking Keyboard\"), \". It's a mechanical split keybord, sized at 60% (which means it has less keys than your common 101-key keyboard, only 60% of them to be precise, and compensates for that with the use of layers reached through modified keys) and fully programmable. I'm still optimizing the macros I have configured on it. I got it with red switches (linear and non clicky, I can't stand keyboards I can't use while holding a conversation ;)) and put a Git-themed keyset on it which I absolutely adore. And it's finally made me switch to US ANSI layout, which indeed is way better suited for coding than ISO DE. The UHK also supports some additional modules, and I have a trackpoint and an additional thumb keycluster on order once they finally release.\"), mdx(\"p\", null, mdx(\"img\", {\n    parentName: \"p\",\n    \"src\": \"./keyboard.jpg\",\n    \"alt\": \"Closeup of my Ultimate Hacking Keyboard\"\n  })), mdx(\"p\", null, \"No matter how good you can memorize keyboard shortcuts (or how well the mouse layer of the UHK works), you still also need a \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"mouse\"), \". In my case that's been gaming mice exclusively for 15+ years now, with a ton of turnover due to wear out or quality issues. Currently I'm sporting a \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://steelseries.com/gaming-mice/rival-310\"\n  }, \"Steelseries Rival 310\"), \" after my last mouse, a Roccat Kone XTD, developed a flaky mouse wheel I couldn't fix, even though I tried my best. Apparently a design flaw. The Steelseries has so far worked nicely, but I've only had it for less than six months at the time of writing this. It's an asymmetric mouse tailored for use with the right hand. I can reach the side buttons easily and it isn't too heavy or too light either.\"), mdx(\"p\", null, \"I also have a \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"trackball\"), \" though, dedicated to be used with my \", mdx(\"em\", {\n    parentName: \"p\"\n  }, \"left\"), \" hand. Whenever I notice my right wrist acting up, I switch to exclusive trackball use for a while, and that has managed to still avert Bad Things a number of times now. If you find yourself regularly suffering from RSI issues on your mouse hand, I can really recommend to mix things up with a trackball on your left. Personally I got a \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.kensington.com/p/products/electronic-control-solutions/trackball-products/slimblade-trackball/\"\n  }, \"Kensington Slimblade\"), \". It's symmetrical and the buttons are easily remapped to fit a left hand operation. And the huge ball can also be used as a scrollwheel and is actually also a great fidget toy to have on the desk at all times ;)\"), mdx(\"h2\", null, \"Desk and chair\"), mdx(\"p\", null, \"In my opinion, there are two pieces of furniture you should never cheap out on: your \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"office chair\"), \" and your bed. I bought my \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.sedus.com/en/products/chairs/netwin\"\n  }, \"sedus netwin\"), \" office chair right after finishing university in 2007 and apart from having gotten a bit more dirty here and there it's as good as new. I initially got it with a set of arm rests, but quickly figured out that those were actually detrimental to my posture and made me pull my shoulders up, leading to tension related pain. So I removed them. I've also gotten it a bit more pronounced lumbar support through the aid of \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.amazon.de/gp/product/B07PB7G3QJ/\"\n  }, \"an add-on\"), \", the likes of which you can order online for less than 10\\u20AC a piece. If I were to buy a new chair today, I'd probably get one with a head rest to keep me a bit more from slouching during long debugging or gaming sessions, but all in all I'm still completely happy with it, and the mesh back has proven to make sitting on it on hot summer days more bearable.\"), mdx(\"p\", null, mdx(\"img\", {\n    parentName: \"p\",\n    \"src\": \"./chair.jpg\",\n    \"alt\": \"My office chair, with a lumbar support addon\"\n  })), mdx(\"p\", null, \"I've now had an \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"electric standing desk\"), \" since January 2016. I'm currently trying to get into the habit of daily use of the standing mode again and so far it's looking good. I got the \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.ikea.com/de/de/p/bekant-schreibtisch-sitz-steh-weiss-s69022537/\"\n  }, \"IKEA Bekant\"), \" desk, and have since modified it to use the alternative \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://github.com/gcormier/megadesk\"\n  }, \"Megadesk\"), \" controller to give it position memory slots (and hopefully also to hook it up into my home automation system long term). I can't stress enough what a difference it can make to just stand for a while during your work day. Exclusively standing should definitely also be avoided (I've had to do this recently for a couple of days because my back would \", mdx(\"em\", {\n    parentName: \"p\"\n  }, \"not\"), \" take sitting for an answer anymore, and it did a bit of a number on my ankles and knees), but regularly switching between sitting and standing is a great way not only to keep your posture intact but also to just get back your concentration. I currently work sitting until my lunch break, then switch to a couple hours of standing before either returning to sitting or calling it a day.\"), mdx(\"p\", null, \"Speaking of sitting and standing -- I also recently acquired a bunch of accessories to make that more dynamic. While standing, I now regularly plant my feet on a \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"balance board\"), \" (a \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.my-gymba.de/en\"\n  }, \"Gymba\"), \" one in my case). It allows me to move while standing, to vary my stance more easily and frankly, it's also a ton of fun to seesaw back and forth while working. I use it with shoes - you can also use it barefoot/in socks, but frankly that was a bit to tough a surface or my feet. Your mileage may vary of course.\"), mdx(\"p\", null, \"I also got myself a \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"wobble stool\"), \" from \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.flexispot.com/height-adjustable-wobble-stool-bh1b\"\n  }, \"Flexispot\"), \". Imagine a stool, but instead of being stable it has a rounded base that makes it constantly wobble around. You cannot easily slouch on that, you'll fall over. Mine can be height adjusted from 61 to 82cm, so I use it both while standing as a small break, but also while sitting. I'm still getting used to it and am experimenting with heights and best way to sit on it, but it's so far been a great addition and doesn't take up much space (a serious plus in my limited office space).\"), mdx(\"h2\", null, \"Monitor mounts\"), mdx(\"p\", null, \"Last but not least, I've got my two main monitors mounted on a \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"dual monitor mount\"), \", in my case a \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"http://www.puremounts.de/pm-office-dm-23d.html\"\n  }, \"gas lift one from PureMounts\"), \" (the small third monitor is mounted to the second one with a self designed printed mounting solution). The stands usually included with monitors tend to not offer enough flexibility to truly dial in the position of the screen in my experience, and this also managed to free up a \", mdx(\"em\", {\n    parentName: \"p\"\n  }, \"ton\"), \" of desktop real estate that I can now utilize. In my case, a wallmount is not an option due to the standing desk situation, so I instead went for a desk mount. A gas lift is not the most stable option in my experience: things can be a bit shaky when I accidentally bump against the desk due to the rather extreme lever position I had to chose to make things work in my office, but it has been working just fine now since 2012. Still, at some point I might get something a bit more static. In any case, a monitor mount is something I'd highly recommended for everyone really, even if you don't want if for ergonomic reasons -- I cannot emphasize the increase in desk space enough ;)\"), mdx(\"p\", null, mdx(\"img\", {\n    parentName: \"p\",\n    \"src\": \"./monitors.jpg\",\n    \"alt\": \"My monitors, mounted on a gas lift mount\"\n  })), mdx(\"h2\", null, \"tl;dr\"), mdx(\"p\", null, \"Get a split ergo keyboard, a gaming mouse for your primary and a trackball for your off hand. Don't cheap out on your office chair, seriously consider investment in a standing desk, get a balance board with it and finally reclaim your desk and improve your workplace's ergonomy at the same time with a monitor mount.\"));\n}\n\n;\nMDXContent.isMDXComponent = true;","renderedOutput":"<p>I&#x27;ve been working full time from my home office since mid-2014 now. At the time of writing this post this is nearing 7 years. Naturally, considering how much time I spend there, I&#x27;ve also spent a lot of thought and money on making sure my workplace helps to keep the usual side effects of the mostly sedentary lifestyle of a developer at bay.</p><p>Over the years I&#x27;ve had some run ins with RSI and backpain. My first wrist issues developed more than 10 years ago. Pain in my lower back beyond &quot;all fine again after a good night&#x27;s sleep&quot; started in February of 2014. Both have been repeating visitors since then. You can probably imagine that that has led to a lot of research and experimentation to see what works and what doesn&#x27;t for me. So, here&#x27;s a summary of my findings as of March 2021. Quick disclaimer though, this is what has proven to work for <strong>me</strong>, that doesn&#x27;t mean it will work for you, if in doubt please consult a professional. Also, I do link to some products here -- consider those references to give you more details on my setup, not official endorsement or anything like that.</p><h2>Keyboard and mouse</h2><p>For my wrists, <strong>ergonomic keyboards</strong> have proven to be crucial in combating the dreaded pain and numbness. I started with a <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://www.microsoft.com/en-us/p/natural-ergonomic-keyboard-4000/\">Microsoft Natural Ergonomic Keyboard 4000</a> (what a name...), switched over to an <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://www.microsoft.com/en-us/p/microsoft-sculpt-ergonomic-desktop/\">Microsoft Ergo Sculpt</a>, had a quick detour over a regularly shaped <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://www.duckychannel.com.tw/en/Ducky-One-RGB-TKL\">Ducky One TKL</a> to get my feet wet in mechanical keyboards and these days have arrived at the 1st gen <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://ultimatehackingkeyboard.com/\">Ultimate Hacking Keyboard</a>. It&#x27;s a mechanical split keybord, sized at 60% (which means it has less keys than your common 101-key keyboard, only 60% of them to be precise, and compensates for that with the use of layers reached through modified keys) and fully programmable. I&#x27;m still optimizing the macros I have configured on it. I got it with red switches (linear and non clicky, I can&#x27;t stand keyboards I can&#x27;t use while holding a conversation ;)) and put a Git-themed keyset on it which I absolutely adore. And it&#x27;s finally made me switch to US ANSI layout, which indeed is way better suited for coding than ISO DE. The UHK also supports some additional modules, and I have a trackpoint and an additional thumb keycluster on order once they finally release.</p><p><img pathname=\"/blog/2021-03-13-my-workplace\" src=\"/assets/content/blog/2021-03-13-my-workplace/keyboard.jpg\" alt=\"Closeup of my Ultimate Hacking Keyboard\"/></p><p>No matter how good you can memorize keyboard shortcuts (or how well the mouse layer of the UHK works), you still also need a <strong>mouse</strong>. In my case that&#x27;s been gaming mice exclusively for 15+ years now, with a ton of turnover due to wear out or quality issues. Currently I&#x27;m sporting a <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://steelseries.com/gaming-mice/rival-310\">Steelseries Rival 310</a> after my last mouse, a Roccat Kone XTD, developed a flaky mouse wheel I couldn&#x27;t fix, even though I tried my best. Apparently a design flaw. The Steelseries has so far worked nicely, but I&#x27;ve only had it for less than six months at the time of writing this. It&#x27;s an asymmetric mouse tailored for use with the right hand. I can reach the side buttons easily and it isn&#x27;t too heavy or too light either.</p><p>I also have a <strong>trackball</strong> though, dedicated to be used with my <em>left</em> hand. Whenever I notice my right wrist acting up, I switch to exclusive trackball use for a while, and that has managed to still avert Bad Things a number of times now. If you find yourself regularly suffering from RSI issues on your mouse hand, I can really recommend to mix things up with a trackball on your left. Personally I got a <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://www.kensington.com/p/products/electronic-control-solutions/trackball-products/slimblade-trackball/\">Kensington Slimblade</a>. It&#x27;s symmetrical and the buttons are easily remapped to fit a left hand operation. And the huge ball can also be used as a scrollwheel and is actually also a great fidget toy to have on the desk at all times ;)</p><h2>Desk and chair</h2><p>In my opinion, there are two pieces of furniture you should never cheap out on: your <strong>office chair</strong> and your bed. I bought my <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://www.sedus.com/en/products/chairs/netwin\">sedus netwin</a> office chair right after finishing university in 2007 and apart from having gotten a bit more dirty here and there it&#x27;s as good as new. I initially got it with a set of arm rests, but quickly figured out that those were actually detrimental to my posture and made me pull my shoulders up, leading to tension related pain. So I removed them. I&#x27;ve also gotten it a bit more pronounced lumbar support through the aid of <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://www.amazon.de/gp/product/B07PB7G3QJ/\">an add-on</a>, the likes of which you can order online for less than 10€ a piece. If I were to buy a new chair today, I&#x27;d probably get one with a head rest to keep me a bit more from slouching during long debugging or gaming sessions, but all in all I&#x27;m still completely happy with it, and the mesh back has proven to make sitting on it on hot summer days more bearable.</p><p><img pathname=\"/blog/2021-03-13-my-workplace\" src=\"/assets/content/blog/2021-03-13-my-workplace/chair.jpg\" alt=\"My office chair, with a lumbar support addon\"/></p><p>I&#x27;ve now had an <strong>electric standing desk</strong> since January 2016. I&#x27;m currently trying to get into the habit of daily use of the standing mode again and so far it&#x27;s looking good. I got the <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://www.ikea.com/de/de/p/bekant-schreibtisch-sitz-steh-weiss-s69022537/\">IKEA Bekant</a> desk, and have since modified it to use the alternative <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://github.com/gcormier/megadesk\">Megadesk</a> controller to give it position memory slots (and hopefully also to hook it up into my home automation system long term). I can&#x27;t stress enough what a difference it can make to just stand for a while during your work day. Exclusively standing should definitely also be avoided (I&#x27;ve had to do this recently for a couple of days because my back would <em>not</em> take sitting for an answer anymore, and it did a bit of a number on my ankles and knees), but regularly switching between sitting and standing is a great way not only to keep your posture intact but also to just get back your concentration. I currently work sitting until my lunch break, then switch to a couple hours of standing before either returning to sitting or calling it a day.</p><p>Speaking of sitting and standing -- I also recently acquired a bunch of accessories to make that more dynamic. While standing, I now regularly plant my feet on a <strong>balance board</strong> (a <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://www.my-gymba.de/en\">Gymba</a> one in my case). It allows me to move while standing, to vary my stance more easily and frankly, it&#x27;s also a ton of fun to seesaw back and forth while working. I use it with shoes - you can also use it barefoot/in socks, but frankly that was a bit to tough a surface or my feet. Your mileage may vary of course.</p><p>I also got myself a <strong>wobble stool</strong> from <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"https://www.flexispot.com/height-adjustable-wobble-stool-bh1b\">Flexispot</a>. Imagine a stool, but instead of being stable it has a rounded base that makes it constantly wobble around. You cannot easily slouch on that, you&#x27;ll fall over. Mine can be height adjusted from 61 to 82cm, so I use it both while standing as a small break, but also while sitting. I&#x27;m still getting used to it and am experimenting with heights and best way to sit on it, but it&#x27;s so far been a great addition and doesn&#x27;t take up much space (a serious plus in my limited office space).</p><h2>Monitor mounts</h2><p>Last but not least, I&#x27;ve got my two main monitors mounted on a <strong>dual monitor mount</strong>, in my case a <a pathname=\"/blog/2021-03-13-my-workplace\" href=\"http://www.puremounts.de/pm-office-dm-23d.html\">gas lift one from PureMounts</a> (the small third monitor is mounted to the second one with a self designed printed mounting solution). The stands usually included with monitors tend to not offer enough flexibility to truly dial in the position of the screen in my experience, and this also managed to free up a <em>ton</em> of desktop real estate that I can now utilize. In my case, a wallmount is not an option due to the standing desk situation, so I instead went for a desk mount. A gas lift is not the most stable option in my experience: things can be a bit shaky when I accidentally bump against the desk due to the rather extreme lever position I had to chose to make things work in my office, but it has been working just fine now since 2012. Still, at some point I might get something a bit more static. In any case, a monitor mount is something I&#x27;d highly recommended for everyone really, even if you don&#x27;t want if for ergonomic reasons -- I cannot emphasize the increase in desk space enough ;)</p><p><img pathname=\"/blog/2021-03-13-my-workplace\" src=\"/assets/content/blog/2021-03-13-my-workplace/monitors.jpg\" alt=\"My monitors, mounted on a gas lift mount\"/></p><h2>tl;dr</h2><p>Get a split ergo keyboard, a gaming mouse for your primary and a trackball for your off hand. Don&#x27;t cheap out on your office chair, seriously consider investment in a standing desk, get a balance board with it and finally reclaim your desk and improve your workplace&#x27;s ergonomy at the same time with a monitor mount.</p>","scope":{}}},"seo":{"title":"My workplace setup","description":"How I try to keep backpain and RSI at bay","openGraph":{"title":"My workplace setup","url":"https://foosel.net/blog/2021-03-13-my-workplace","description":"How I try to keep backpain and RSI at bay","images":[{"url":"https://foosel.net/assets/content/blog/2021-03-13-my-workplace/office.jpg","alt":"My workplace - three monitors, desk, chair, keyboard, mouse, trackball","external":"https://foosel.net/assets/content/blog/2021-03-13-my-workplace/office.jpg"}],"type":"article","article":{"publishedTime":"2021-03-13T00:00:00Z","modifiedTime":"2021-03-13T00:00:00Z"}}},"previous":{"link":"/blog/2021-03-12-hello-world","title":"Hello World!"},"next":{"link":"/blog/2021-03-19-on-wrong-assumptions","title":"On wrong assumptions"}},"__N_SSG":true}